app/controllers/expenses_controller.rb

  def create
    @expense = Expense.new(expense_params)
    @expenses = Expense.all
    respond_to do |format|
      if @expense.save
---
SELECT "expenses".* FROM "expenses"
INSERT INTO "expenses" ("description", "amount", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Yoga retreat deposit"], ["amount", 155.0], ["date", "2015-07-13 13:18:00.000000"], ["created_at", "2015-07-26 13:19:23.743082"], ["updated_at", "2015-07-26 13:19:23.743082"]]

  def destroy_all
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"